# ExportLineweightKey Properties

---
The ExportLineweightKey type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OriginalLineweight|  The original line weight.
Top
#### Reference
ExportLineweightKey Class
Autodesk.Revit.DB Namespace